IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_dma_cla_src_sel_regs.xml
<module id="DMA_CLA_SRC_SEL_REGS" HW_revision="" description="DMA CLA SRC SEL Registers">
	<register id="DMACHSRCSELLOCK" width="32" page="1" offset="0x4" internal="0" description="DMA Channel Triger Source Select Lock Register">
		<bitfield id="DMACHSRCSEL1" description="DMACHSRCSEL1 Register Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMACHSRCSEL2" description="DMACHSRCSEL2 Register Lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DMACHSRCSEL1" width="32" page="1" offset="0x16" internal="0" description="DMA Channel Trigger Source Select Register-1">
		<bitfield id="CH1" description="Selects the Trigger and Sync Source CH1 of DMA" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CH2" description="Selects the Trigger and Sync Source CH2 of DMA" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="CH3" description="Selects the Trigger and Sync Source CH3 of DMA" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="CH4" description="Selects the Trigger and Sync Source CH4 of DMA" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="DMACHSRCSEL2" width="32" page="1" offset="0x18" internal="0" description="DMA Channel Trigger Source Select Register-2">
		<bitfield id="CH5" description="Selects the Trigger and Sync Source CH5 of DMA" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CH6" description="Selects the Trigger and Sync Source CH6 of DMA" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
</module>
